       IDENTIFICATION DIVISION.
       PROGRAM-ID. EJERCICIO1.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       WORKING-STORAGE SECTION.


       PROCEDURE DIVISION.
       
           DISPLAY "Hola mundo"
           

           STOP RUN.
