       IDENTIFICATION DIVISION.
       PROGRAM-ID. MENSAJE.

       ENVIRONMENT DIVISION.

       DATA DIVISION.
       LINKAGE SECTION.
     
       


       PROCEDURE DIVISION.
       
           DISPLAY "Hola "
           

           EXIT PROGRAM.
